leekilhun/ws_stm32f407_io24/stm32f407vet6_hwTest/src/hw/driver/usb/usbd_conf.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : usbd_conf.h
 * @version        : v1.0_Cube
 * @brief          : Header for usbd_conf.c file.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __USBD_CONF__H__
#define __USBD_CONF__H__

#ifdef __cplusplus
extern "C" {
#endif

  /* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "main.h"
#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"



  /*---------- -----------*/
#define USBD_MAX_NUM_INTERFACES     1U
  /*---------- -----------*/
#define USBD_MAX_NUM_CONFIGURATION     1U
  /*---------- -----------*/
#define USBD_MAX_STR_DESC_SIZ     512U
  /*---------- -----------*/
#define USBD_DEBUG_LEVEL     0U
  /*---------- -----------*/
#define USBD_LPM_ENABLED     0U
  /*---------- -----------*/
#define USBD_SELF_POWERED     1U

  /****************************************/
  /* #define for FS and HS identification */
#define DEVICE_FS     0
#define DEVICE_HS     1

  /**
   * @}
   */

  /** @defgroup USBD_CONF_Exported_Macros USBD_CONF_Exported_Macros
   * @brief Aliases.
   * @{
   */
  /* Memory management macros make sure to use static memory allocation */
  /** Alias for memory allocation. */

#define USBD_malloc         (void *)USBD_static_malloc

  /** Alias for memory release. */
#define USBD_free           USBD_static_free

  /** Alias for memory set. */
#define USBD_memset         memset

  /** Alias for memory copy. */
#define USBD_memcpy         memcpy

  /** Alias for delay. */
#define USBD_Delay          HAL_Delay

  /* DEBUG macros */

#if (USBD_DEBUG_LEVEL > 0)
#define USBD_UsrLog(...)    printf(__VA_ARGS__);\
    printf("\n");
#else
#define USBD_UsrLog(...)
#endif /* (USBD_DEBUG_LEVEL > 0U) */

#if (USBD_DEBUG_LEVEL > 1)

#define USBD_ErrLog(...)    printf("ERROR: ") ;\
    printf(__VA_ARGS__);\
    printf("\n");
#else
#define USBD_ErrLog(...)
#endif /* (USBD_DEBUG_LEVEL > 1U) */

#if (USBD_DEBUG_LEVEL > 2)
#define USBD_DbgLog(...)    printf("DEBUG : ") ;\
    printf(__VA_ARGS__);\
    printf("\n");
#else
#define USBD_DbgLog(...)
#endif /* (USBD_DEBUG_LEVEL > 2U) */






  /* Exported functions -------------------------------------------------------*/
  void *USBD_static_malloc(uint32_t size);
  void USBD_static_free(void *p);


#ifdef __cplusplus
}
#endif

#endif /* __USBD_CONF__H__ */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
